bond-ee/stm32_serial_HID_keyboard/Src/main.c
/**
 ******************************************************************************
 * File Name          : main.c
 * Description        : Main program body
 ******************************************************************************
 * This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * Copyright (c) 2018 STMicroelectronics International N.V.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other
 *    contributors to this software may be used to endorse or promote products
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under
 *    this license is void and will automatically terminate your rights under
 *    this license.
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#include "hid_keyboard.h"

//#define OSX

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART3_UART_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void) {

	/* USER CODE BEGIN 1 */
	struct keyboardHID_t {
		uint8_t modifiers;
		uint8_t reserved;
		uint8_t key1;
	};
	struct keyboardHID_t keyboardHID;
	keyboardHID.modifiers = 0;
	keyboardHID.key1 = 0;

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_USART3_UART_Init();
	MX_USB_DEVICE_Init();

	/* USER CODE BEGIN 2 */
	uint8_t receivedData[3];

	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1) {
		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */
		receivedData[0] = 0;
		receivedData[1] = 0;
		receivedData[2] = 0;

		HAL_UART_Receive(&huart3, receivedData, 3, 10);
		HAL_UART_Transmit(&huart3, receivedData, 3, 10);

		//Capital letters
		if (receivedData[0] >= 0x41 && receivedData[0] <= 0x5A) {
			keyboardHID.key1 = KB_A + (receivedData[0] - 0x41);
			keyboardHID.modifiers = 0x02;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}
		//lower case letters
		else if (receivedData[0] >= 0x61 && receivedData[0] <= 0x7A) {
			keyboardHID.key1 = KB_A + (receivedData[0] - 0x61);
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}
		//Enter
		else if (receivedData[0] == 0x0D) {
			keyboardHID.key1 = KB_ENTER;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}
		//Space
		else if (receivedData[0] == 0x20) {
			keyboardHID.key1 = KB_SPACEBAR;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}
		//Numbers 1-9
		else if (receivedData[0] >= 0x31 && receivedData[0] <= 0x39) {
			keyboardHID.key1 = KB_1 + (receivedData[0] - 0x31);
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}
		//Number 0
		else if (receivedData[0] == 0x30) {
			keyboardHID.key1 = KB_0;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}
		//Up arrow
#ifdef OSX
		else if (receivedData[0] == 0xe2 && receivedData[1] == 0x88
				&& receivedData[2] == 0x91) {

#else
		else if (receivedData[0] == 0x1b && receivedData[1] == ASCII_w) {
#endif
			keyboardHID.key1 = KB_UP;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}

		//Left arrow
#ifdef OSX
		else if (receivedData[0] == 0xc3 && receivedData[1] == 0xa5) {

#else
		else if (receivedData[0] == 0x1b && receivedData[1] == ASCII_a) {
#endif
			keyboardHID.key1 = KB_LEFT;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}
		//Down arrow

#ifdef OSX
		else if (receivedData[0] == 0xc3 && receivedData[1] == 0x9f) {

#else
		else if (receivedData[0] == 0x1b && receivedData[1] == ASCII_s) {

#endif
			keyboardHID.key1 = KB_DOWN;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}
		//right arrow

#ifdef OSX
		else if (receivedData[0] == 0xe2 && receivedData[1] == 0x88
				&& receivedData[2] == 0x82) {

#else
		else if (receivedData[0] == 0x1b && receivedData[1] == ASCII_d) {

#endif
			keyboardHID.key1 = KB_RIGHT;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}
		//Backspace
#ifdef OSX
		else if (receivedData[0] == 0xc5 && receivedData[1] == 0x93) {
#else
		else if (receivedData[0] == 0x1b && receivedData[1] == ASCII_q) {
#endif

			keyboardHID.key1 = KB_BACKSPC;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}

#ifdef OSX
		//TODO: Add delete for OSX
#else
		else if (receivedData[0] == 0x1b && receivedData[1] == ASCII_e) {
#endif
			keyboardHID.key1 = KB_DELETE;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);
		}

		if (receivedData[0] != 0) {
			keyboardHID.key1 = 0;
			keyboardHID.modifiers = 0;
			USBD_HID_SendReport(&hUsbDeviceFS, &keyboardHID,
					sizeof(struct keyboardHID_t));
			HAL_Delay(30);

