bond-ee/stm32_serial_HID_keyboard/Src/main.c
		}

		keyboardHID.key1 = 0;
		keyboardHID.modifiers = 0;

	}

	/* USER CODE END 3 */

}

/** System Clock Configuration
 */
void SystemClock_Config(void) {

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

	/**Configure the main internal regulator output voltage
	 */
	__HAL_RCC_PWR_CLK_ENABLE()
	;

	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI
			| RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = 16;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 4;
	RCC_OscInitStruct.PLL.PLLN = 72;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 3;
	RCC_OscInitStruct.PLL.PLLR = 2;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
			| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CLK48;
	PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48CLKSOURCE_PLLQ;
	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

	/**Configure the Systick interrupt time
	 */
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USART3 init function */
static void MX_USART3_UART_Init(void) {

	huart3.Instance = USART3;
	huart3.Init.BaudRate = 115200;
	huart3.Init.WordLength = UART_WORDLENGTH_8B;
	huart3.Init.StopBits = UART_STOPBITS_1;
	huart3.Init.Parity = UART_PARITY_NONE;
	huart3.Init.Mode = UART_MODE_TX_RX;
	huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart3.Init.OverSampling = UART_OVERSAMPLING_16;
	if (HAL_UART_Init(&huart3) != HAL_OK) {
		_Error_Handler(__FILE__, __LINE__);
	}

}

/** Configure pins
 PE4   ------> SAI1_FS_A
 PG14   ------> USART6_TX
 PE1   ------> FMC_NBL1
 PE0   ------> FMC_NBL0
 PB8   ------> I2C1_SCL
 PB3   ------> I2S3_CK
 PC12   ------> SDIO_CK
 PE5   ------> SAI1_SCK_A
 PB9   ------> I2C1_SDA
 PB6   ------> QUADSPI_BK1_NCS
 PG15   ------> FMC_SDNCAS
 PD6   ------> SAI1_SD_A
 PD0   ------> FMC_D2_DA2
 PC11   ------> SDIO_D3
 PC10   ------> SDIO_D2
 PI4   ------> FMC_NBL2
 PD1   ------> FMC_D3_DA3
 PI3   ------> FMC_D27
 PI2   ------> FMC_D26
 PF0   ------> FMC_A0
 PI5   ------> FMC_NBL3
 PI7   ------> FMC_D29
 PI10   ------> FMC_D31
 PI6   ------> FMC_D28
 PG9   ------> USART6_RX
 PD2   ------> SDIO_CMD
 PH15   ------> FMC_D23
 PI1   ------> FMC_D25
 PF1   ------> FMC_A1
 PI9   ------> FMC_D30
 PH13   ------> FMC_D21
 PH14   ------> FMC_D22
 PI0   ------> FMC_D24
 PC9   ------> SDIO_D1
 PF2   ------> FMC_A2
 PC8   ------> SDIO_D0
 PF3   ------> FMC_A3
 PH4   ------> I2C2_SCL
 PG8   ------> FMC_SDCLK
 PF4   ------> FMC_A4
 PH5   ------> I2C2_SDA
 PH3   ------> FMC_SDNE0
 PG7   ------> SAI1_MCLK_A
 PF7   ------> QUADSPI_BK1_IO2
 PF6   ------> QUADSPI_BK1_IO3
 PF5   ------> FMC_A5
 PH2   ------> FMC_SDCKE0
 PD15   ------> FMC_D1_DA1
 PD10   ------> FMC_D15_DA15
 PF10   ------> QUADSPI_CLK
 PF9   ------> QUADSPI_BK1_IO1
 PF8   ------> QUADSPI_BK1_IO0
 PD14   ------> FMC_D0_DA0
 PD9   ------> FMC_D14_DA14
 PD8   ------> FMC_D13_DA13
 PC0   ------> FMC_SDNWE
 PF12   ------> FMC_A6
 PG1   ------> FMC_A11
 PF15   ------> FMC_A9
 PD13   ------> S_TIM4_CH2
 PH12   ------> FMC_D20
 PF13   ------> FMC_A7
 PG0   ------> FMC_A10
 PE8   ------> FMC_D5_DA5
 PG5   ------> FMC_A15_BA1
 PG4   ------> FMC_A14_BA0
 PH9   ------> FMC_D17
 PH11   ------> FMC_D19
 PF14   ------> FMC_A8
 PJ2   ------> DSIHOST_TE
 PF11   ------> FMC_SDNRAS
 PE9   ------> FMC_D6_DA6
 PE11   ------> FMC_D8_DA8
 PE14   ------> FMC_D11_DA11
 PH8   ------> FMC_D16
 PH10   ------> FMC_D18
 PE7   ------> FMC_D4_DA4
 PE10   ------> FMC_D7_DA7
 PE12   ------> FMC_D9_DA9
 PE15   ------> FMC_D12_DA12
 PE13   ------> FMC_D10_DA10
 */
static void MX_GPIO_Init(void) {

	GPIO_InitTypeDef GPIO_InitStruct;

	/* GPIO Ports Clock Enable */
	__HAL_RCC_GPIOE_CLK_ENABLE()
	;
	__HAL_RCC_GPIOG_CLK_ENABLE()
	;
	__HAL_RCC_GPIOB_CLK_ENABLE()
	;
	__HAL_RCC_GPIOC_CLK_ENABLE()
	;
	__HAL_RCC_GPIOA_CLK_ENABLE()
	;
	__HAL_RCC_GPIOD_CLK_ENABLE()
	;
	__HAL_RCC_GPIOI_CLK_ENABLE()
	;
	__HAL_RCC_GPIOF_CLK_ENABLE()
	;
	__HAL_RCC_GPIOK_CLK_ENABLE()
	;
	__HAL_RCC_GPIOH_CLK_ENABLE()
	;
	__HAL_RCC_GPIOJ_CLK_ENABLE()
	;

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOE, SPKR_HP_Pin | AUDIO_RST_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOD, LED3_Pin | LED2_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(LED4_GPIO_Port, LED4_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOB, OTG_FS1_PowerSwitchOn_Pin | EXT_RESET_Pin,
			GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_Port, LCD_BL_CTRL_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pins : SAI1_FSA_Pin SAI1_SCKA_Pin */
	GPIO_InitStruct.Pin = SAI1_FSA_Pin | SAI1_SCKA_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	GPIO_InitStruct.Alternate = GPIO_AF6_SAI1;
	HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

